kbreddiee/octokey/firmware/hub/sdkconfig.defaults
# espkvm hub — ESP32-S3 DevKitC-1
CONFIG_IDF_TARGET="esp32s3"

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# 1 ms tick for snappy input handling
CONFIG_FREERTOS_HZ=1000

# Latency over size
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# HKDF for pairing key derivation (off by default in IDF)
CONFIG_MBEDTLS_HKDF_C=y

# ESP-NOW supports at most 6-7 encrypted peers by default; we need 10
# dongles + the broadcast pseudo-peer.
CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM=14
